Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster[0].google_container_cluster.cluster has changed
~ resource "google_container_cluster" "cluster" {
        id                          = "projects/dark-axe-359021/locations/us-central1/clusters/atlantis-cluster"
        name                        = "atlantis-cluster"
        # (28 unchanged attributes hidden)














      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = []
          + image_type        = "COS_CONTAINERD"
          + labels            = {}
          + local_ssd_count   = 0
          + machine_type      = "g1-small"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "tf-gke-linux-node-pool@dark-axe-359021.iam.gserviceaccount.com"
          + spot              = false
          + tags              = []
          + taint             = []

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + node_pool {
          + initial_node_count          = 2
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-c/instanceGroupManagers/gke-atlantis-cluster-linux-node-pool-6e26b162-grp",
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-a/instanceGroupManagers/gke-atlantis-cluster-linux-node-pool-a8c2bc2d-grp",
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-f/instanceGroupManagers/gke-atlantis-cluster-linux-node-pool-01d52ef2-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-c/instanceGroups/gke-atlantis-cluster-linux-node-pool-6e26b162-grp",
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-a/instanceGroups/gke-atlantis-cluster-linux-node-pool-a8c2bc2d-grp",
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-f/instanceGroups/gke-atlantis-cluster-linux-node-pool-01d52ef2-grp",
            ]
          + max_pods_per_node           = 32
          + name                        = "linux-node-pool"
          + node_count                  = 1
          + node_locations              = [
              + "us-central1-a",
              + "us-central1-c",
              + "us-central1-f",
            ]
          + version                     = "1.22.11-gke.400"

          + autoscaling {
              + max_node_count = 3
              + min_node_count = 1
            }

          + management {
              + auto_repair  = true
              + auto_upgrade = false
            }

          + network_config {
              + create_pod_range    = false
              + pod_ipv4_cidr_block = "192.168.0.0/17"
              + pod_range           = "pods"
            }

          + node_config {
              + disk_size_gb      = 100
              + disk_type         = "pd-ssd"
              + guest_accelerator = []
              + image_type        = "COS_CONTAINERD"
              + labels            = {}
              + local_ssd_count   = 0
              + machine_type      = "g1-small"
              + metadata          = {
                  + "disable-legacy-endpoints" = "true"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + preemptible       = false
              + service_account   = "tf-gke-linux-node-pool@dark-axe-359021.iam.gserviceaccount.com"
              + spot              = false
              + tags              = []
              + taint             = []

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }
      + node_pool {
          + initial_node_count          = 2
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-c/instanceGroupManagers/gke-atlantis-cluster-windows-node-poo-2faeb210-grp",
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-a/instanceGroupManagers/gke-atlantis-cluster-windows-node-poo-6d4296af-grp",
              + "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/zones/us-central1-f/instanceGroupManagers/gke-atlantis-cluster-windows-node-poo-2aa06fed-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-c/instanceGroups/gke-atlantis-cluster-windows-node-poo-2faeb210-grp",
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-a/instanceGroups/gke-atlantis-cluster-windows-node-poo-6d4296af-grp",
              + "https://www.googleapis.com/compute/beta/projects/dark-axe-359021/zones/us-central1-f/instanceGroups/gke-atlantis-cluster-windows-node-poo-2aa06fed-grp",
            ]
          + max_pods_per_node           = 32
          + name                        = "windows-node-pool"
          + node_count                  = 1
          + node_locations              = [
              + "us-central1-a",
              + "us-central1-c",
              + "us-central1-f",
            ]
          + version                     = "1.22.11-gke.400"

          + autoscaling {
              + max_node_count = 1
              + min_node_count = 1
            }

          + management {
              + auto_repair  = true
              + auto_upgrade = false
            }

          + network_config {
              + create_pod_range    = false
              + pod_ipv4_cidr_block = "192.168.0.0/17"
              + pod_range           = "pods"
            }

          + node_config {
              + disk_size_gb      = 100
              + disk_type         = "pd-ssd"
              + guest_accelerator = []
              + image_type        = "WINDOWS_LTSC_CONTAINERD"
              + labels            = {}
              + local_ssd_count   = 0
              + machine_type      = "n1-standard-2"
              + metadata          = {
                  + "disable-legacy-endpoints"   = "true"
                  + "windows-startup-script-url" = "https://storage.googleapis.com/ibrahimab-public/update_containerd_166.ps1"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + preemptible       = false
              + service_account   = "tf-gke-windows-node-pool@dark-axe-359021.iam.gserviceaccount.com"
              + spot              = false
              + tags              = []
              + taint             = [
                  + {
                      + effect = "NO_SCHEDULE"
                      + key    = "node.kubernetes.io/os"
                      + value  = "windows"
                    },
                ]

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }






        # (19 unchanged blocks hidden)
    }

  # module.firewall.google_compute_firewall.custom-rules["gke-ingress"] has changed
~ resource "google_compute_firewall" "custom-rules" {
        id                      = "projects/dark-axe-359021/global/firewalls/gke-ingress"
        name                    = "gke-ingress"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.firewall.google_compute_firewall.custom-rules["gke-rdp-access"] has changed
~ resource "google_compute_firewall" "custom-rules" {
        id                      = "projects/dark-axe-359021/global/firewalls/gke-rdp-access"
        name                    = "gke-rdp-access"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.firewall_rules.google_compute_firewall.rules["allow-ingress"] has changed
~ resource "google_compute_firewall" "rules" {
        id                      = "projects/dark-axe-359021/global/firewalls/allow-ingress"
        name                    = "allow-ingress"
      + source_service_accounts = []
      + target_service_accounts = []
      + target_tags             = []
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.firewall_rules.google_compute_firewall.rules["egress"] has changed
~ resource "google_compute_firewall" "rules" {
        id                      = "projects/dark-axe-359021/global/firewalls/egress"
        name                    = "egress"
      + source_ranges           = []
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (8 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.nat.google_compute_router.router[0] has changed
~ resource "google_compute_router" "router" {
        id                            = "projects/dark-axe-359021/regions/us-central1/routers/cloud-nat-nat"
        name                          = "cloud-nat-nat"
        # (6 unchanged attributes hidden)

      ~ bgp {
          + advertised_groups  = []
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.cloud_sql[0].google_sql_database_instance.primary will be created
+ resource "google_sql_database_instance" "primary" {
      + connection_name               = (known after apply)
      + database_version              = "SQLSERVER_2017_STANDARD"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "development-db-eiuvu"
      + private_ip_address            = (known after apply)
      + project                       = "dark-axe-359021"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + root_password                 = (sensitive value)
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "REGIONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-custom-8-52480"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = "23:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/global/networks/development-vpc"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.linux_nodepool[0].google_container_node_pool.nodepool will be updated in-place
~ resource "google_container_node_pool" "nodepool" {
        id                          = "projects/dark-axe-359021/locations/us-central1/clusters/atlantis-cluster/nodePools/linux-node-pool"
        name                        = "linux-node-pool"
        # (10 unchanged attributes hidden)





      ~ upgrade_settings {
          ~ max_surge       = 1 -> 0
            # (1 unchanged attribute hidden)
        }
        # (4 unchanged blocks hidden)
    }

  # module.nodepool_windows[0].google_container_node_pool.nodepool will be updated in-place
~ resource "google_container_node_pool" "nodepool" {
        id                          = "projects/dark-axe-359021/locations/us-central1/clusters/atlantis-cluster/nodePools/windows-node-pool"
        name                        = "windows-node-pool"
        # (10 unchanged attributes hidden)





      ~ upgrade_settings {
          ~ max_surge       = 1 -> 0
            # (1 unchanged attribute hidden)
        }
        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.cluster.google_container_cluster.cluster,
│   on modules/gke-cluster/main.tf line 46, in resource "google_container_cluster" "cluster":
│   46:   enable_binary_authorization = var.enable_binary_authorization
│ 
│ Deprecated in favor of binary_authorization.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-vns3s2yxpa-uc.a.run.app/lock?id=mcdermg%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
